Revit 2027 API
ProjectionMethod Enumeration
 Projection method
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ProjectionMethod
Public Enumeration ProjectionMethod
public enum class ProjectionMethod
type ProjectionMethod
Members
Member name | Value | Description
Orthographic | 0 |  Orthographic
Perspective | 1 |  Perspective
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace